---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserTreadConnection
source: html/62490c35-692b-9c99-6a90-c969a3b35711.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserTreadConnection Property

"Riser To Tread Connection"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTrisertypeRiserTreadConnection { get; }
```